RPA.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ges="http://ws.jgestordocumental.bankguay.com/gestordocumental"
	xmlns:ws="http://ws.jgestordocumental.bankguay.com/">
	<soapenv:Header/>
	<soapenv:Body>
		<ges:saveDocument>
			<document>
				<ws:idDocument>123</ws:idDocument>
				<ws:documentType>
					<!-- Codigo del tipo de documento on base -->
					<ws:idType>1710</ws:idType>
					<!-- Nombre de documento on base -->
					<ws:name>SB - Providencias</ws:name>
					<!-- Keywords on base -->
					<ws:keywords>
						<ws:name>Numero Oficio</ws:name>
						<ws:value>SB4569879</ws:value>
					</ws:keywords>
				</ws:documentType>
				<ws:filename>providencia.jpg</ws:filename>
				<!-- se detalla explicación en correo -->
				<ws:image>cid:1338590810057</ws:image>
				<ws:identification>0922647110</ws:identification>
				<ws:idExpedient>2727155</ws:idExpedient>
			</document>
			<!-- debe insertar el documento en formato base 64 -->
			<imageBase64>XXXXXXXXXXXXXX</imageBase64>
			<!-- campos de auditoria -->
			<auditInfo>
				<ws:user>rpa_user</ws:user>
				<ws:identification>0922647110</ws:identification>
				<ws:idExpedient>2727155</ws:idExpedient>
				<ws:originIP>172.26.66.175</ws:originIP>
			</auditInfo>
		</ges:saveDocument>
	</soapenv:Body>
</soapenv:Envelope>